Documents/упУстановкаПравилРасчетаДоходовИРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упУстановкаПравилРасчетаДоходовИРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упПравилаРасчетаТарифов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыДокументаУстановкаПравилРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТарифов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВСилу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упПравилаРасчетаТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПравилаРасчетаТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравилоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаТарифов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упТипыДокументаУстановкаПравилРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыДокументаУстановкаПравилРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упУстановкаПравилРасчетаДоходовИРасходов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИнициализироватьДокумент(ДанныеЗаполнения);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
	ДокументЗаполненКорректно(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыИФункцииОбеспеченияПроведения

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует движения по регистрам.
//
// Параметры: 
//  Нет.
//
Процедура ДвиженияПоРегистрам()
	
	Движения.упПравилаРасчетаТарифов.Записывать = Истина;
	Движения.упПравилаРасчетаТарифов.Очистить();
	
	Для Каждого текСтрока Из ПравилаРасчета Цикл
		НовДвижение = Движения.упПравилаРасчетаТарифов.Добавить();
		НовДвижение.Регистратор				= Ссылка;
		НовДвижение.Период					= ДатаВступленияВСилу;
		НовДвижение.Организация				= Организация;
		НовДвижение.ПравилоРасчета			= текСтрока.ПравилоРасчета;
		НовДвижение.СтатьяДоходовРасходов	= текСтрока.СтатьяДоходовРасходов;
		НовДвижение.Валюта					= текСтрока.Валюта;
		НовДвижение.ГруппаТарифов			= ГруппаТарифов;
	КонецЦикла;
	
Конецпроцедуры // ДвиженияПоРегистрам()


// Проверяет корректно ли осуществлено заполнение документа.
//
// Параметры:
//  Отказ - Булево - признак отказа.
//
Процедура ДокументЗаполненКорректно(Отказ)
	
	текЗапрос = Новый Запрос;
	текЗапрос.Текст = "ВЫБРАТЬ
	|	тбСтатьиДоходовРасходов.СтатьяДоходовРасходов
	|ПОМЕСТИТЬ втСтатьиДоходовРасходов
	|ИЗ
	|	Документ.упУстановкаПравилРасчетаДоходовИРасходов.ПравилаРасчета КАК тбСтатьиДоходовРасходов
	|ГДЕ
	|	тбСтатьиДоходовРасходов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тбСтатьиДоходовРасходов.СтатьяДоходовРасходов
	|ИЗ
	|	втСтатьиДоходовРасходов КАК тбСтатьиДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	тбСтатьиДоходовРасходов.СтатьяДоходовРасходов
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(тбСтатьиДоходовРасходов.СтатьяДоходовРасходов) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тбСтатьиДоходовРасходов.СтатьяДоходовРасходов
	|ИЗ
	|	РегистрСведений.упПравилаРасчетаТарифов КАК тбТарифы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтатьиДоходовРасходов КАК тбСтатьиДоходовРасходов
	|		ПО тбТарифы.СтатьяДоходовРасходов = тбСтатьиДоходовРасходов.СтатьяДоходовРасходов
	|ГДЕ
	|	тбТарифы.Период = &Период
	|	И тбТарифы.Организация = &Организация
	|	И тбТарифы.ГруппаТарифов = &ГруппаТарифов
	|	И НЕ тбТарифы.Регистратор = &Ссылка";
	текЗапрос.УстановитьПараметр("Ссылка", 		  ЭтотОбъект.Ссылка);
	текЗапрос.УстановитьПараметр("Период", 		  НачалоДня(ЭтотОбъект.ДатаВступленияВСилу));
	текЗапрос.УстановитьПараметр("Организация",   ЭтотОбъект.Организация);
	текЗапрос.УстановитьПараметр("ГруппаТарифов", ЭтотОбъект.ГруппаТарифов);
	
	текРезультат = текЗапрос.ВыполнитьПакет();
	
	тбзПовторяющиесяСтроки 		 = текРезультат[1].Выгрузить();
	Если тбзПовторяющиесяСтроки.Количество()>0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В табличной части есть строки с повторяющейся номенклатурой'"),
				ЭтотОбъект,
				"",
				,
				Отказ);
		Возврат;
	КонецЕсли;
	
	тбзЗначенияПоказателейНаДату = текРезультат[2].Выгрузить();
	
	Для каждого текСтрока Из тбзЗначенияПоказателейНаДату Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для статьи:"""+текСтрока.СтатьяДоходовРасходов+""" значение на дату:"+Формат(ЭтотОбъект.ДатаВступленияВСилу,"ДФ=dd.MM.yyyy")+" уже установлено"+"'"),
				ЭтотОбъект,
				"",
				,
				Отказ);
	КонецЦикла;
	
КонецПроцедуры // ДокументЗаполненКорректно()

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Инициализация и заполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)

	Организация		= Справочники.Организации.ОрганизацияПоУмолчанию();
	ТипДокумента	= ПредопределенноеЗначение("Перечисление.упТипыДокументаУстановкаПравилРасчета.Доходы");
	ДатаВступленияВСилу	= ТекущаяДата();

КонецПроцедуры

#КонецОбласти
